---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundInRoutingPreferenceError
source: html/0e14fef1-ceb2-dd88-e352-a22f55cc7605.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.PartNotFoundInRoutingPreferenceError Property

"%1s is not found. Please review the routing preference of %2s."

## Syntax (C#)
```csharp
public static FailureDefinitionId PartNotFoundInRoutingPreferenceError { get; }
```